server/app/controllers/experiment_controller.rb

  def index
    @experiments = Experiment.all
---
SELECT "experiments".* FROM "experiments"

  def create
    @experiment = Experiment.new(start_params)

    if @experiment.save
---
INSERT INTO "experiments" ("time_start", "target", "metric", "user_id", "created_at", "updated_at", "model", "dataset") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @experiment.update(end_params)
---
UPDATE "experiments" SET "final_score" = $1, "updated_at" = $2 WHERE "experiments"."id" = $3  [["final_score", 0.8], ["updated_at", "2020-03-11 17:25:20.903930"], ["id", 57]]

  def destroy
    @model.destroy
    @experiment.destroy
---
DELETE FROM "experiments" WHERE "experiments"."id" = $1  [["id", 37]]

  def set_experiment
    @experiment = Experiment.find(params[:id])
---
SELECT "experiments".* FROM "experiments" WHERE "experiments"."id" = $1 LIMIT $2  [["id", 123], ["LIMIT", 1]]