app/controllers/experiment_controller.rb

SELECT "experiments".* FROM "experiments"
---
  def index
    @experiments = Experiment.all

INSERT INTO "experiments" ("time_start", "target", "metric", "user_id", "created_at", "updated_at", "model", "dataset") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @experiment = Experiment.new(start_params)

    if @experiment.save

UPDATE "experiments" SET "final_score" = $1, "updated_at" = $2 WHERE "experiments"."id" = $3  [["final_score", 0.8], ["updated_at", "2020-03-11 17:25:20.903930"], ["id", 57]]
---
  def update
    if @experiment.update(end_params)

DELETE FROM "experiments" WHERE "experiments"."id" = $1  [["id", 37]]
---
  def destroy
    @model.destroy
    @experiment.destroy

SELECT "experiments".* FROM "experiments" WHERE "experiments"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]
---
  def set_experiment
    @experiment = Experiment.find(params[:id])