app/controllers/user_controller.rb

SELECT "users"."id", "users"."username" FROM "users"
---
  def index
    @users = User.select('id', 'username').all

INSERT INTO "users" ("username", "email", "role", "name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.role = 'user'

    if @user.save

UPDATE "users" SET "username" = $1, "email" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["username", "bbber"], ["email", "test4@email.com"], ["password_digest", "$2a$12$98iarWsyBX0cyGNY/r2.5Omjh5UG75XHt5ewAyy.4jNNnfax2jajS"], ["updated_at", "2020-03-07 15:22:09.304057"], ["id", 1]]
---
  def update
    if @user.update(user_params)